
## Plan Result (dev)

[CI link](https://github.com/fumi-mura/terraform-sample/actions/runs/14926066532)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.test_3_cwlogs.aws_cloudwatch_log_group.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.test_3_cwlogs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "test-3"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Name" = "test-3"
        }
      + tags_all          = {
          + "Environment"        = "dev"
          + "ManagedByTerraform" = "true"
          + "Name"               = "test-3"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":42,"Program":"tfcmt","SHA1":"d1b0ef444080dc72a30ca947b8310676b4cae23b","Target":"dev","Vars":{},"WorkflowName":"Plan"} -->